In [1]:
import pandas as pd
import datetime as dt

In [2]:
my_date = dt.date(2020, 3, 22)
my_date

datetime.date(2020, 3, 22)

In [3]:
type(my_date)

datetime.date

In [4]:
str(my_date)

'2020-03-22'

In [5]:
my_date.day

22

In [6]:
my_date.month

3

In [7]:
my_date.year

2020

In [10]:
my_datetime = dt.datetime(2025, 12, 13, 8, 20, 50)

In [11]:
str(my_datetime)

'2025-12-13 08:20:50'

In [12]:
my_datetime.hour

8

In [14]:
my_datetime.minute

20

In [15]:
import calendar
print(calendar.month(2024, 4))

     April 2024
Mo Tu We Th Fr Sa Su
 1  2  3  4  5  6  7
 8  9 10 11 12 13 14
15 16 17 18 19 20 21
22 23 24 25 26 27 28
29 30

In [19]:
dates = pd.Series(['2024/04/02','2024-12-15','March 22nd, 2024'])  #convert panda series to datetime
dates

0          2024/04/02
1          2024-12-15
2    March 22nd, 2024
dtype: object

In [26]:
import datetime as dt

In [27]:
mydate = dt.datetime(2003, 4, 2, 12, 30, 20)
str(mydate)

'2003-04-02 12:30:20'

In [28]:
pd.Timestamp('2024, 4 , 2')

Timestamp('2024-04-02 00:00:00')

In [30]:
pd.Timestamp('2024, 4, 2, 11')

Timestamp('2024-04-02 11:00:00')

In [31]:
pd.Timestamp(dt.datetime(2024, 4, 2, 8, 30, 22))

Timestamp('2024-04-02 08:30:22')

In [32]:
day1 = pd.Timestamp('1998, 3, 22, 10')
day2 = pd.Timestamp('2021, 3, 22, 10')
delta = day2-day1
print(delta)

8401 days 00:00:00

In [33]:
date1 = dt.date(2020, 3, 22)   #three dates in a list
date2 = dt.date(2020, 4, 22)
date3 = dt.date(2020, 5, 22)

In [34]:
dates_list = [date1, date2, date3]
dates_index = pd.DatetimeIndex(dates_list)
dates_index

DatetimeIndex(['2020-03-22', '2020-04-22', '2020-05-22'], dtype='datetime64[ns]', freq=None)

In [35]:
sales = [50, 55, 60]

In [36]:
sales = pd.Series(data = sales, index = dates_index)
sales

2020-03-22    50
2020-04-22    55
2020-05-22    60
dtype: int64

In [37]:
my_days = pd.date_range(start = '2020-01-02', end = '2020-04-02', freq = 'D')  #range of dates
my_days

DatetimeIndex(['2020-01-02', '2020-01-03', '2020-01-04', '2020-01-05',
               '2020-01-06', '2020-01-07', '2020-01-08', '2020-01-09',
               '2020-01-10', '2020-01-11', '2020-01-12', '2020-01-13',
               '2020-01-14', '2020-01-15', '2020-01-16', '2020-01-17',
               '2020-01-18', '2020-01-19', '2020-01-20', '2020-01-21',
               '2020-01-22', '2020-01-23', '2020-01-24', '2020-01-25',
               '2020-01-26', '2020-01-27', '2020-01-28', '2020-01-29',
               '2020-01-30', '2020-01-31', '2020-02-01', '2020-02-02',
               '2020-02-03', '2020-02-04', '2020-02-05', '2020-02-06',
               '2020-02-07', '2020-02-08', '2020-02-09', '2020-02-10',
               '2020-02-11', '2020-02-12', '2020-02-13', '2020-02-14',
               '2020-02-15', '2020-02-16', '2020-02-17', '2020-02-18',
               '2020-02-19', '2020-02-20', '2020-02-21', '2020-02-22',
               '2020-02-23', '2020-02-24', '2020-02-25', '2020-02-26',
               '2020-02-27', '2020-02-28', '2020-02-29', '2020-03-01',
               '2020-03-02', '2020-03-03', '2020-03-04', '2020-03-05',
               '2020-03-06', '2020-03-07', '2020-03-08', '2020-03-09',
               '2020-03-10', '2020-03-11', '2020-03-12', '2020-03-13',
               '2020-03-14', '2020-03-15', '2020-03-16', '2020-03-17',
               '2020-03-18', '2020-03-19', '2020-03-20', '2020-03-21',
               '2020-03-22', '2020-03-23', '2020-03-24', '2020-03-25',
               '2020-03-26', '2020-03-27', '2020-03-28', '2020-03-29',
               '2020-03-30', '2020-03-31', '2020-04-01', '2020-04-02'],
              dtype='datetime64[ns]', freq='D')

In [38]:
type(my_days)

pandas.core.indexes.datetimes.DatetimeIndex

In [42]:
type(my_days[4])

pandas._libs.tslibs.timestamps.Timestamp

In [43]:
my_days = pd.date_range(start = '2020-01-01', end = '2020-08-01', freq = 'M') #list of months
my_days

/var/folders/1m/p3tg7hsx09j7cx935ffkzdn40000gn/T/ipykernel_91233/4237509507.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  my_days = pd.date_range(start = '2020-01-01', end = '2020-08-01', freq = 'M')

DatetimeIndex(['2020-01-31', '2020-02-29', '2020-03-31', '2020-04-30',
               '2020-05-31', '2020-06-30', '2020-07-31'],
              dtype='datetime64[ns]', freq='ME')

In [44]:
pd.date_range(start = '2024-01-01', periods = 20, freq = 'D') #def list of dates

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10', '2024-01-11', '2024-01-12',
               '2024-01-13', '2024-01-14', '2024-01-15', '2024-01-16',
               '2024-01-17', '2024-01-18', '2024-01-19', '2024-01-20'],
              dtype='datetime64[ns]', freq='D')

In [45]:
my_days = pd.date_range(start = '2020-01-01', end = '2020-04-01', freq = 'B') #business days
my_days

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-06',
               '2020-01-07', '2020-01-08', '2020-01-09', '2020-01-10',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-20', '2020-01-21', '2020-01-22',
               '2020-01-23', '2020-01-24', '2020-01-27', '2020-01-28',
               '2020-01-29', '2020-01-30', '2020-01-31', '2020-02-03',
               '2020-02-04', '2020-02-05', '2020-02-06', '2020-02-07',
               '2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13',
               '2020-02-14', '2020-02-17', '2020-02-18', '2020-02-19',
               '2020-02-20', '2020-02-21', '2020-02-24', '2020-02-25',
               '2020-02-26', '2020-02-27', '2020-02-28', '2020-03-02',
               '2020-03-03', '2020-03-04', '2020-03-05', '2020-03-06',
               '2020-03-09', '2020-03-10', '2020-03-11', '2020-03-12',
               '2020-03-13', '2020-03-16', '2020-03-17', '2020-03-18',
               '2020-03-19', '2020-03-20', '2020-03-23', '2020-03-24',
               '2020-03-25', '2020-03-26', '2020-03-27', '2020-03-30',
               '2020-03-31', '2020-04-01'],
              dtype='datetime64[ns]', freq='B')

In [122]:
avocado_df = pd.read_csv('avocado.csv')
avocado_df

             Date  AveragePrice  Total Volume          type            region
0      12/27/2015          1.33      64236.62  conventional            Albany
1      12/20/2015          1.35      54876.98  conventional            Albany
2      12/13/2015          0.93     118220.22  conventional            Albany
3       12/6/2015          1.08      78992.15  conventional            Albany
4      11/29/2015          1.28      51039.60  conventional            Albany
...           ...           ...           ...           ...               ...
18244    2/4/2018          1.63      17074.83       organic  WestTexNewMexico
18245   1/28/2018          1.71      13888.04       organic  WestTexNewMexico
18246   1/21/2018          1.87      13766.76       organic  WestTexNewMexico
18247   1/14/2018          1.93      16205.22       organic  WestTexNewMexico
18248    1/7/2018          1.62      17489.58       organic  WestTexNewMexico

[18249 rows x 5 columns]

In [123]:
avocado_df['Date'] = pd.to_datetime(avocado_df['Date'])
avocado_df

            Date  AveragePrice  Total Volume          type            region
0     2015-12-27          1.33      64236.62  conventional            Albany
1     2015-12-20          1.35      54876.98  conventional            Albany
2     2015-12-13          0.93     118220.22  conventional            Albany
3     2015-12-06          1.08      78992.15  conventional            Albany
4     2015-11-29          1.28      51039.60  conventional            Albany
...          ...           ...           ...           ...               ...
18244 2018-02-04          1.63      17074.83       organic  WestTexNewMexico
18245 2018-01-28          1.71      13888.04       organic  WestTexNewMexico
18246 2018-01-21          1.87      13766.76       organic  WestTexNewMexico
18247 2018-01-14          1.93      16205.22       organic  WestTexNewMexico
18248 2018-01-07          1.62      17489.58       organic  WestTexNewMexico

[18249 rows x 5 columns]

In [101]:
avocado_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          18249 non-null  datetime64[ns]
 1   AveragePrice  18249 non-null  float64
 2   Total Volume  18249 non-null  float64
 3   type          18249 non-null  object
 4   region        18249 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 713.0+ KB

In [102]:
avocado_df.set_index(keys = ['Date'], inplace = True) #set date as index

In [103]:
avocado_df.head(10)

            AveragePrice  Total Volume          type  region
Date
2015-12-27          1.33      64236.62  conventional  Albany
2015-12-20          1.35      54876.98  conventional  Albany
2015-12-13          0.93     118220.22  conventional  Albany
2015-12-06          1.08      78992.15  conventional  Albany
2015-11-29          1.28      51039.60  conventional  Albany
2015-11-22          1.26      55979.78  conventional  Albany
2015-11-15          0.99      83453.76  conventional  Albany
2015-11-08          0.98     109428.33  conventional  Albany
2015-11-01          1.02      99811.42  conventional  Albany
2015-10-25          1.07      74338.76  conventional  Albany

In [104]:
avocado_df.values

array([[1.33, 64236.62, 'conventional', 'Albany'],
       [1.35, 54876.98, 'conventional', 'Albany'],
       [0.93, 118220.22, 'conventional', 'Albany'],
       ...,
       [1.87, 13766.76, 'organic', 'WestTexNewMexico'],
       [1.93, 16205.22, 'organic', 'WestTexNewMexico'],
       [1.62, 17489.58, 'organic', 'WestTexNewMexico']], dtype=object)

In [105]:
avocado_df.columns

Index(['AveragePrice', 'Total Volume', 'type', 'region'], dtype='object')

In [106]:
avocado_df.index

DatetimeIndex(['2015-12-27', '2015-12-20', '2015-12-13', '2015-12-06',
               '2015-11-29', '2015-11-22', '2015-11-15', '2015-11-08',
               '2015-11-01', '2015-10-25',
               ...
               '2018-03-11', '2018-03-04', '2018-02-25', '2018-02-18',
               '2018-02-11', '2018-02-04', '2018-01-28', '2018-01-21',
               '2018-01-14', '2018-01-07'],
              dtype='datetime64[ns]', name='Date', length=18249, freq=None)

In [107]:
avocado_df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 18249 entries, 2015-12-27 to 2018-01-07
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   AveragePrice  18249 non-null  float64
 1   Total Volume  18249 non-null  float64
 2   type          18249 non-null  object
 3   region        18249 non-null  object
dtypes: float64(2), object(2)
memory usage: 712.9+ KB

In [114]:
avocado_df = pd.read_csv('avocado.csv')
avocado_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          18249 non-null  object
 1   AveragePrice  18249 non-null  float64
 2   Total Volume  18249 non-null  float64
 3   type          18249 non-null  object
 4   region        18249 non-null  object
dtypes: float64(2), object(3)
memory usage: 713.0+ KB

In [119]:
avocado_df.head(10)

         Date  AveragePrice  Total Volume          type  region
0  12/27/2015          1.33      64236.62  conventional  Albany
1  12/20/2015          1.35      54876.98  conventional  Albany
2  12/13/2015          0.93     118220.22  conventional  Albany
3   12/6/2015          1.08      78992.15  conventional  Albany
4  11/29/2015          1.28      51039.60  conventional  Albany
5  11/22/2015          1.26      55979.78  conventional  Albany
6  11/15/2015          0.99      83453.76  conventional  Albany
7   11/8/2015          0.98     109428.33  conventional  Albany
8   11/1/2015          1.02      99811.42  conventional  Albany
9  10/25/2015          1.07      74338.76  conventional  Albany

In [74]:
avocado_df.iloc[5]

AveragePrice            1.26
Total Volume        55979.78
type            conventional
region                Albany
Name: 2015-11-22 00:00:00, dtype: object

In [125]:
avocado_df.sort_index(inplace = True)

In [78]:
avocado_df.truncate('2017-01-01','2018-02-01') #truncate/obtain sample btw given date

            AveragePrice  Total Volume          type         region
Date
2017-01-01          1.23      66616.54       organic   SouthCentral
2017-01-01          1.34      36915.87       organic        Chicago
2017-01-01          1.06      15669.84       organic  DallasFtWorth
2017-01-01          1.43      49777.56       organic      Southeast
2017-01-01          1.51       3969.98       organic        Roanoke
...                  ...           ...           ...            ...
2018-01-28          1.70       4300.76       organic        Spokane
2018-01-28          1.20    2278728.69  conventional        NewYork
2018-01-28          1.43       7669.31       organic       Columbus
2018-01-28          1.34     486679.98  conventional       Portland
2018-01-28          1.34     548587.07  conventional        Seattle

[6154 rows x 4 columns]

In [84]:
avocado_df.index = avocado_df.index + pd.DateOffset(months = 12, days = 30) #move dates forward for about an year
avocado_df

            AveragePrice  Total Volume          type              region
Date
2016-02-03          1.75      27365.89       organic           Southeast
2016-02-03          1.49      17723.17       organic             Chicago
2016-02-03          1.68       2896.72       organic  HarrisburgScranton
2016-02-03          1.52      54956.80  conventional          Pittsburgh
2016-02-03          1.64       1505.12       organic               Boise
...                  ...           ...           ...                 ...
2019-04-24          1.36     908202.13  conventional             Chicago
2019-04-24          0.70    9010588.32  conventional        SouthCentral
2019-04-24          1.42     163496.70       organic        SouthCentral
2019-04-24          1.70     190257.38       organic          California
2019-04-24          1.34    1774776.77  conventional             NewYork

[18249 rows x 4 columns]

In [85]:
avocado_df.index = avocado_df.index - pd.DateOffset(months = 12, days = 30)
avocado_df

            AveragePrice  Total Volume          type              region
Date
2015-01-04          1.75      27365.89       organic           Southeast
2015-01-04          1.49      17723.17       organic             Chicago
2015-01-04          1.68       2896.72       organic  HarrisburgScranton
2015-01-04          1.52      54956.80  conventional          Pittsburgh
2015-01-04          1.64       1505.12       organic               Boise
...                  ...           ...           ...                 ...
2018-03-25          1.36     908202.13  conventional             Chicago
2018-03-25          0.70    9010588.32  conventional        SouthCentral
2018-03-25          1.42     163496.70       organic        SouthCentral
2018-03-25          1.70     190257.38       organic          California
2018-03-25          1.34    1774776.77  conventional             NewYork

[18249 rows x 4 columns]

In [ ]:
avocado_df.resample(rule = 'A').mean()

In [ ]:
avocado_df.resample(rule = 'ME').mean()

In [93]:
avocado_df.resample(rule = 'Q').max()

/var/folders/1m/p3tg7hsx09j7cx935ffkzdn40000gn/T/ipykernel_91233/3033411215.py:1: FutureWarning: 'Q' is deprecated and will be removed in a future version, please use 'QE' instead.
  avocado_df.resample(rule = 'Q').max()

            AveragePrice  Total Volume     type            region
Date
2015-03-31          2.38   44655461.51  organic  WestTexNewMexico
2015-06-30          2.40   41291704.39  organic  WestTexNewMexico
2015-09-30          2.79   37943670.34  organic  WestTexNewMexico
2015-12-31          2.79   31047484.27  organic  WestTexNewMexico
2016-03-31          2.38   52288697.89  organic  WestTexNewMexico
2016-06-30          2.40   46324529.70  organic  WestTexNewMexico
2016-09-30          2.91   39993186.04  organic  WestTexNewMexico
2016-12-31          3.25   31621221.90  organic  WestTexNewMexico
2017-03-31          3.05   61034457.10  organic  WestTexNewMexico
2017-06-30          3.17   47293921.60  organic  WestTexNewMexico
2017-09-30          3.04   39367336.18  organic  WestTexNewMexico
2017-12-31          3.00   38267341.61  organic  WestTexNewMexico
2018-03-31          2.30   62505646.52  organic  WestTexNewMexico

In [126]:
avocado_df.set_index(keys = ['Date'], inplace = True)

In [127]:
low_price = avocado_df['AveragePrice'].where(avocado_df['AveragePrice']<1.2)
low_price

Date
2015-12-27     NaN
2015-12-20     NaN
2015-12-13    0.93
2015-12-06    1.08
2015-11-29     NaN
              ...
2018-02-04     NaN
2018-01-28     NaN
2018-01-21     NaN
2018-01-14     NaN
2018-01-07     NaN
Name: AveragePrice, Length: 18249, dtype: float64

In [128]:
low_price = avocado_df['AveragePrice'].where(avocado_df['AveragePrice']<1.3).resample('1M').count()
low_price

/var/folders/1m/p3tg7hsx09j7cx935ffkzdn40000gn/T/ipykernel_91233/2692335877.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  low_price = avocado_df['AveragePrice'].where(avocado_df['AveragePrice']<1.3).resample('1M').count()

Date
2015-01-31    224
2015-02-28    220
2015-03-31    271
2015-04-30    198
2015-05-31    271
2015-06-30    201
2015-07-31    224
2015-08-31    254
2015-09-30    202
2015-10-31    217
2015-11-30    284
2015-12-31    226
2016-01-31    300
2016-02-29    254
2016-03-31    270
2016-04-30    276
2016-05-31    330
2016-06-30    240
2016-07-31    248
2016-08-31    185
2016-09-30    175
2016-10-31    155
2016-11-30    109
2016-12-31    233
2017-01-31    306
2017-02-28    269
2017-03-31    180
2017-04-30    187
2017-05-31    135
2017-06-30    140
2017-07-31    124
2017-08-31     55
2017-09-30     21
2017-10-31     41
2017-11-30    117
2017-12-31    232
2018-01-31    177
2018-02-28    189
2018-03-31    196
Freq: ME, Name: AveragePrice, dtype: int64

In [129]:
avocado_df

            AveragePrice  Total Volume          type            region
Date
2015-12-27          1.33      64236.62  conventional            Albany
2015-12-20          1.35      54876.98  conventional            Albany
2015-12-13          0.93     118220.22  conventional            Albany
2015-12-06          1.08      78992.15  conventional            Albany
2015-11-29          1.28      51039.60  conventional            Albany
...                  ...           ...           ...               ...
2018-02-04          1.63      17074.83       organic  WestTexNewMexico
2018-01-28          1.71      13888.04       organic  WestTexNewMexico
2018-01-21          1.87      13766.76       organic  WestTexNewMexico
2018-01-14          1.93      16205.22       organic  WestTexNewMexico
2018-01-07          1.62      17489.58       organic  WestTexNewMexico

[18249 rows x 4 columns]

In [144]:
avocado_df.reset_index(inplace=True)

In [145]:
avocado_df

            Date  AveragePrice  Total Volume          type            region
0     2015-12-27          1.33      64236.62  conventional            Albany
1     2015-12-20          1.35      54876.98  conventional            Albany
2     2015-12-13          0.93     118220.22  conventional            Albany
3     2015-12-06          1.08      78992.15  conventional            Albany
4     2015-11-29          1.28      51039.60  conventional            Albany
...          ...           ...           ...           ...               ...
18244 2018-02-04          1.63      17074.83       organic  WestTexNewMexico
18245 2018-01-28          1.71      13888.04       organic  WestTexNewMexico
18246 2018-01-21          1.87      13766.76       organic  WestTexNewMexico
18247 2018-01-14          1.93      16205.22       organic  WestTexNewMexico
18248 2018-01-07          1.62      17489.58       organic  WestTexNewMexico

[18249 rows x 5 columns]

In [146]:
avocado_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          18249 non-null  datetime64[ns]
 1   AveragePrice  18249 non-null  float64
 2   Total Volume  18249 non-null  float64
 3   type          18249 non-null  object
 4   region        18249 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 713.0+ KB